EDT/УТ/src/Documents/ВозвратЗаказовОтВодителя/ВозвратЗаказовОтВодителя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВозвратЗаказовОтВодителя</name>
  <registerRecords>InformationRegister.экУчетПроизводственныхОпераций</registerRecords>
  <registerRecords>InformationRegister.СтатусыСкладскогоУчета</registerRecords>
  <attributes>
    <name>ОтчетВодителя</name>
    <comment>УДАЛИТЬ</comment>
    <type>
      <types>DocumentRef.новаОтчетВодителя</types>
    </type>
  </attributes>
  <attributes>
    <name>Рейс</name>
    <type>
      <types>DocumentRef.Рейс</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.новаВодители</types>
    </type>
  </attributes>
  <attributes>
    <name>Экспедитор</name>
    <type>
      <types>CatalogRef.новаЭкспедиторы</types>
    </type>
  </attributes>
  <attributes>
    <name>УдаленноеЗакрытие</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТерминалДоставки</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗакрытСРасхождением</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимПодтвержденияУдаленногоЗакрытия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументУдаленногоЗакрытия</name>
    <type>
      <types>DocumentRef.ВозвратЗаказовОтВодителя</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Доставки</name>
    <attributes>
      <name>Доставка</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>РезультатДоставки</name>
      <type>
        <types>CatalogRef.новаРезультатМестнойДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаНеВыполненияДоставки</name>
      <type>
        <types>CatalogRef.ПричиныНеВыполненияДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>ВозвратТоваров</name>
      <type>
        <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаполненоПоДаннымБД</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПринятНаСкладеПолностью</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПринятНаСкладеЧастично</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>БылоВскрытиеЗаказа</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КВозврату</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>АктПоступил</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПринятоРанее</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоМестПринято</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидПроблемы</name>
      <type>
        <types>CatalogRef.ВидыПроблемПриПриемкеЗаказовОтЭкипажей</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоДоговор</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипВозврата</name>
      <type>
        <types>CatalogRef.СтатусыСкладскогоУчета</types>
      </type>
    </attributes>
    <attributes>
      <name>Вскрытый</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоМест</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусИндикации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Доставка</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоИсходное</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПринятНаСкладе</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодНоменклатуры</name>
      <type>
        <types>CatalogRef.ШтрихкодыТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>Принято</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодМаркировки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДанныеМПВодителя</name>
    <attributes>
      <name>ДанныеМП</name>
      <type>
        <types>DocumentRef.ДанныеЗаказаВодителя</types>
      </type>
    </attributes>
    <attributes>
      <name>Учитывать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Доставка</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МестаЗаказов</name>
    <attributes>
      <name>Доставка</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>Место</name>
      <type>
        <types>CatalogRef.МестаПоЗаказам</types>
      </type>
    </attributes>
    <attributes>
      <name>Принято</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Штрихкоды</name>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШКТовара</name>
      <type>
        <types>CatalogRef.ШтрихкодыТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>МестоЗаказа</name>
      <type>
        <types>CatalogRef.МестаПоЗаказам</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЛогСканированияШК</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РучнойВвод</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/InformationRegisters/НастройкиПользователей/НастройкиПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиПользователей</name>
  <comment>(Общ)</comment>
  <resources>
    <name>Значение</name>
    <comment>(Общ)</comment>
    <type>
      <types>Characteristic.НастройкиПользователей</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Настройка</name>
    <comment>(Общ)</comment>
    <type>
      <types>ChartOfCharacteristicTypesRef.НастройкиПользователей</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Enums/ВидыТорговогоОборудования/ВидыТорговогоОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыТорговогоОборудования</name>
  <enumValues>
    <name>СканерШтрихКода</name>
  </enumValues>
  <enumValues>
    <name>ФискальныйРегистратор</name>
  </enumValues>
  <enumValues>
    <name>ТерминалСбораДанных</name>
  </enumValues>
  <enumValues>
    <name>ДисплейПокупателя</name>
  </enumValues>
  <enumValues>
    <name>СчитывательМагнитныхКарт</name>
  </enumValues>
  <enumValues>
    <name>ЭлектронныеВесы</name>
  </enumValues>
  <enumValues>
    <name>ВесыСПечатьюЭтикеток</name>
  </enumValues>
  <enumValues>
    <name>ККМOffline</name>
  </enumValues>
  <enumValues>
    <name>ККМOnline</name>
  </enumValues>
  <enumValues>
    <name>ЭквайринговаяСистема</name>
  </enumValues>
  <enumValues>
    <name>СчитывательRFIDМеток</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Enums/ТипыЗаказов/ТипыЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыЗаказов</name>
  <enumValues>
    <name>Доставка</name>
  </enumValues>
  <enumValues>
    <name>Самовывоз</name>
  </enumValues>
  <enumValues>
    <name>Забор</name>
  </enumValues>
  <enumValues>
    <name>Фрахт</name>
  </enumValues>
  <enumValues>
    <name>Возврат</name>
  </enumValues>
  <enumValues>
    <name>Обмен</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Documents/ВозвратЗаказовОтВодителя/Forms/ФормаСписка/Module.bsl
&НаСервере
Функция ПоискДокументаНаСервере(НомерР)	Экспорт 
	
	Склад = Неопределено;
	
	Рейс = Документы.Рейс.НайтиПоНомеру(СокрЛП(НомерР));
	
	Если НЕ ЗначениеЗаполнено(Рейс) Тогда		
		Сообщить("Не найден рейс с номером " + СокрЛП(НомерРейса));	
		Возврат Неопределено;	
	КонецЕсли;
	
	ЗапросСклад = Новый Запрос("ВЫБРАТЬ
			                   |	НастройкиПользователей.Значение
			                   |ИЗ
			                   |	РегистрСведений.НастройкиПользователей КАК НастройкиПользователей
			                   |ГДЕ
			                   |	НастройкиПользователей.Пользователь = &Пользователь
			                   |	И НастройкиПользователей.Настройка = &Настройка");
	ЗапросСклад.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийПользователь);
	ЗапросСклад.УстановитьПараметр("Настройка", ПланыВидовХарактеристик.НастройкиПользователей.Склад);
	РезСклад = ЗапросСклад.Выполнить().Выбрать();
	
	Если РезСклад.Следующий() Тогда	
		Склад = РезСклад.Значение;		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Склад) Тогда
		Сообщить("Отсутствует значение настройки пользователя ""Склад """);	
		Возврат Неопределено;
	КонецЕсли;
	
	//Асеев 16.09.2020 (Задача № 4249)>>>
	УдаленноеЗакрытиеИлиПодтверждение = ТумблерОтбора = 2 Или ТумблерОтбора = 3;
	Если УдаленноеЗакрытиеИлиПодтверждение Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Рейс", Рейс);
		Запрос.УстановитьПараметр("Склад", Склад);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ВозвратЗаказовОтВодителя.Ссылка КАК Ссылка,
		|	ВозвратЗаказовОтВодителя.УдаленноеЗакрытие КАК УдаленноеЗакрытие,
		|	ВозвратЗаказовОтВодителя.РежимПодтвержденияУдаленногоЗакрытия КАК РежимПодтвержденияУдаленногоЗакрытия
		|ИЗ
		|	Документ.ВозвратЗаказовОтВодителя КАК ВозвратЗаказовОтВодителя
		|ГДЕ
		|	ВозвратЗаказовОтВодителя.Рейс = &Рейс
		|	И ВозвратЗаказовОтВодителя.Склад = &Склад";
		
		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		ТаблицаДокументов = Результат.Выгрузить();
		СтрокаУдаленноеЗакрытие = ТаблицаДокументов.Найти(Истина, "УдаленноеЗакрытие");
		СтрокаРежимПодтвержденияУдаленногоЗакрытия = ТаблицаДокументов.Найти(Истина, "РежимПодтвержденияУдаленногоЗакрытия");
		Если СтрокаУдаленноеЗакрытие <> Неопределено И СтрокаРежимПодтвержденияУдаленногоЗакрытия <> Неопределено Тогда
			Возврат СтрокаРежимПодтвержденияУдаленногоЗакрытия.Ссылка;
		ИначеЕсли СтрокаУдаленноеЗакрытие <> Неопределено Тогда
			ДокументВозврат = Документы.ВозвратЗаказовОтВодителя.СоздатьДокумент();	
			ДокументВозврат.Дата = ТекущаяДата();
			ДокументВозврат.Рейс = Рейс;
			ДокументВозврат.Склад = Склад;
			ДокументВозврат.ДокументУдаленногоЗакрытия = СтрокаУдаленноеЗакрытие.Ссылка;
			ДокументВозврат.РежимПодтвержденияУдаленногоЗакрытия = Истина;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
		
	Иначе
		//Асеев 16.09.2020 (Задача № 4249)<<<
		
		// ищем документ по Рейс-Склад
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	ВозвратЗаказовОтВодителя.Ссылка
		|ИЗ
		|	Документ.ВозвратЗаказовОтВодителя КАК ВозвратЗаказовОтВодителя
		|ГДЕ
		|	ВозвратЗаказовОтВодителя.Рейс = &Рейс
		|	И ВозвратЗаказовОтВодителя.Склад = &Склад");
		Запрос.УстановитьПараметр("Рейс", Рейс);
		Запрос.УстановитьПараметр("Склад", Склад);
		Рез = Запрос.Выполнить().Выбрать();		
		
		Если Рез.Следующий() Тогда
			ДокументВозврат = Рез.Ссылка.ПолучитьОбъект();	
			//+++ БАО 13.10.2017 №1920 
			ДокументВозврат.Рейс = Рейс;
			//--- БАО 13.10.2017 №1920
			
		Иначе
			ДокументВозврат = Документы.ВозвратЗаказовОтВодителя.СоздатьДокумент();	
			ДокументВозврат.Дата = ТекущаяДата();
			ДокументВозврат.Рейс = Рейс;
			ДокументВозврат.Склад = Склад;
			//ДокументВозврат.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;
		
	КонецЕсли;
	
	//+++ БАО 13.10.2017 №1920 
	//----ЗаполнитьДокументПоРейсу(ДокументВозврат, Рейс);
	ДокументВозврат.ЗаполнитьПоРейсуНаСервере(ДокументВозврат, Истина);
	//--- БАО 13.10.2017 №1920
	
	Если ДокументВозврат.Доставки.Количество() Тогда		
		ДокументВозврат.Записать(РежимЗаписиДокумента.Запись);		
		Возврат ДокументВозврат.Ссылка;
	Иначе
		Возврат Неопределено;	
	КонецЕсли;
	
	ЭтаФорма.Элементы.Список.Обновить();
	
	
	Если ДокументВозврат.Доставки.Количество() Тогда		
		ДокументВозврат.Записать(РежимЗаписиДокумента.Запись);		
		Возврат ДокументВозврат.Ссылка;
	Иначе
		Возврат Неопределено;	
	КонецЕсли;
	
КонецФункции

//Асеев 16.09.2020 (Задача № 4249)>>>
&НаКлиенте
Процедура ПоискДокументаНаКлиенте(НомерРейса)
	
	Док = ПоискДокументаНаСервере(НомерРейса);
	
	Если ЗначениеЗаполнено(Док) Тогда	
		Док.ПолучитьФорму("ФормаДокумента").Открыть();		
	ИначеЕсли ТумблерОтбора = 2 Или ТумблерОтбора = 3 Тогда 
		//УдаленноеЗакрытиеИлиПодтверждение
		ПоказатьПредупреждение(, "Не найден документ удаленного закрытия или его подтверждение! Смените режим отображения документов в списке!");
	КонецЕсли;	
	
КонецПроцедуры
//Асеев 16.09.2020 (Задача № 4249)<<<

&НаКлиенте
Процедура ПоискДокумента(Команда) Экспорт 
	
	//Асеев 16.09.2020 (Задача № 4249)>>>
	//Док = ПоискДокументаНаСервере(НомерРейса);
	//
	//Если ЗначениеЗаполнено(Док) Тогда	
	//	Док.ПолучитьФорму("ФормаДокумента").Открыть();		
	//КонецЕсли;	
	ПоискДокументаНаКлиенте(НомерРейса);
	//Асеев 16.09.2020 (Задача № 4249)<<<
	
КонецПроцедуры



&НаКлиенте
// Процедура - обработчик внешнего событие, которое возникает при посылке
// внешним приложением сообщения, сформированного в специальном формате.
// Внешнее событие сначала обрабатывается всеми открытыми формами, имеющими
// обработчик этого события, а затем может быть обработано в процедуре модуля
// приложения с именем ОбработкаВнешнегоСобытия().
//
// Параметры:
//  Источник - <Строка>
//           - Источник внешнего события.
//
//  Событие  - <Строка>
//           - Наименование события.
//
//  Данные   - <Строка>
//           - Данные для события.
//
Процедура ВнешнееСобытие(Источник, Событие, Данные)

	Если Не ВводДоступен() Тогда
		Возврат;
	КонецЕсли;
	
	
	// получим человеческий номер рейса
	НомерР = Сред(Данные, 4, 9);
	
	//Асеев 16.09.2020 (Задача № 4249)>>>
	//Док = ПоискДокументаНаСервере(НомерР);
	//
	//Если ЗначениеЗаполнено(Док) Тогда	
	//	Док.ПолучитьФорму("ФормаДокумента").Открыть();		
	//КонецЕсли;
	ПоискДокументаНаКлиенте(НомерР);
	//Асеев 16.09.2020 (Задача № 4249)<<<

	//ПолучитьСерверТО().ОбработатьВнешнееСобытие(Источник, Событие, Данные, ЭтаФорма);
	
	//Если Данные <> Неопределено И Данные <> "" Тогда
	//	
	//	Запрос = Новый Запрос("ВЫБРАТЬ
	//	                      |	ВозвратЗаказовОтВодителя.Ссылка
	//	                      |ИЗ
	//	                      |	Документ.ВозвратЗаказовОтВодителя КАК ВозвратЗаказовОтВодителя
	//	                      |ГДЕ
	//	                      |	ВозвратЗаказовОтВодителя.Рейс.Номер = &Номер
	//	                      |	И ВозвратЗаказовОтВодителя.ПометкаУдаления = ЛОЖЬ");
	//	Запрос.УстановитьПараметр("", );
	//	Рез = Запрос.Выполнить().Выбрать();
	//	
	//	Если Рез.Количество() Тогда		
	//		Док = Рез.Ссылка;
	//		Док
	//	Иначе
	//		Возврат ;	
	//	КонецЕсли;		
	//
	//КонецЕсли;
	
	

КонецПроцедуры // ВнешнееСобытие()

&НаКлиенте
// Функция возвращает признак того, что клиент поддерживает работу с видом ТО,
// переданным в качестве параметра.
//
// Параметры:
//  Вид      - <ПеречислениеСсылка.ВидыТорговогоОборудования>
//           - Вид торгового оборудования, информация о поддержке
//             которого запрашивается.
//
// Возвращаемое значение:
//  <Булево> - Признак поддержки указанного класса торгового оборудования.
//
Функция ПоддерживаетсяВидТО(Вид) Экспорт

	Результат = Ложь;

	Если Вид = Перечисления.ВидыТорговогоОборудования.СканерШтрихКода Тогда
		Результат = Истина;
	КонецЕсли;

	Возврат Результат;

КонецФункции // ПоддерживаетсяВидТО()

///////////////////////////////////////////////////////////////////////////////
//// ФУНКЦИИ ВЗАИМОДЕЙСТВИЯ С ТОРГОВЫМ ОБОРУДОВАНИЕМ (СКАНЕР ШТРИХКОДА)
&НаКлиенте
// Функция осуществляет обработку считывания штрихкода номенклатуры
//
// Параметры:
//  Номенклатура   - <СправочникСсылка.Номенклатура>
//                 - Номенклатура, штрихкод которой был отсканирован.
//
//  Характеристика – <СправочникСсылка.ХарактеристикиНоменклатуры>
//                 - Характеристика отсканированной номенклатуры.
//
//  Серия          - <СправочникСсылка.СерииНоменклатуры>
//                 - Серия отсканированной номенклатуры.
//
//  Качество       - <СправочникСсылка.Качество>
//                 - Качество отсканированной номенклатуры.
//
//  Единица        - <СправочникСсылка.ЕдиницыИзмерения>
//                 - Единица измерения отсканированной номенклатуры.
//
//  Количество     - <Число>
//                 - Количество отсканированной номенклатуры.
//
//  СШК            - <Строка>
//                 - Идентификатор сканера штрихкода, с которым связано данное
//                   событие.
//
// Возвращаемое значение:
//  <Булево>       - Данная ситуация обработана.
//
Функция СШКНоменклатура(Номенклатура, Характеристика, Серия, Качество,
                        Единица, Количество, СШК) Экспорт

	Результат        = Истина;
	//ИмяТекСтраницы   = ЭлементыФормы.ОсновнаяПанель.ТекущаяСтраница.Имя;
	//СтруктураПодбора = РаботаСТорговымОборудованием.СформироватьСтруктуруПодбора(Дата, Номенклатура, Характеристика,
	//												Серия, Качество, Единица,
	//												Количество, ВалютаДокумента,
	//												Неопределено, мУказаниеСкладовВТЧ,
	//												ТипЦен, , ДоговорКонтрагента, УсловиеПродаж);

	//Если      ИмяТекСтраницы = "Товары" Тогда
	//	ОбработкаПодбора(Товары, СтруктураПодбора);
	//ИначеЕсли ИмяТекСтраницы = "Тара" Тогда
	//	ОбработкаПодбора(ВозвратнаяТара, СтруктураПодбора);
	//ИначеЕсли ИмяТекСтраницы = "Услуги" Тогда
	//	ОбработкаПодбора(Услуги, СтруктураПодбора);
	//Иначе
	//	Предупреждение("На странице """
	//				   + ИмяТекСтраницы
	//				   + """ подбор номенклатуры не предусмотрен.");
	//КонецЕсли;

	Возврат Результат;

КонецФункции // СШКНоменклатура()

&НаКлиенте
// Функция осуществляет обработку считывания штрихкода серийного номера
//
// Параметры:
//  Номер    - <СправочникСсылка.СерийныеНомера>
//           - Отсканированный серийный номер.
//
//  СШК      - <Строка>
//           - Идентификатор сканера штрихкода, с которым связано данное
//             событие.
//
// Возвращаемое значение:
//  <Булево> - Данная ситуация обработана.
//
Функция СШКСерийныйНомер(Номер, СШК) Экспорт

	Результат        = Истина;
	//ИмяТекСтраницы   = ЭлементыФормы.ОсновнаяПанель.ТекущаяСтраница.Имя;
	//СтруктураПодбора = РаботаСТорговымОборудованием.СформироватьСтруктуруПодбора(Дата, Неопределено, Неопределено,
	//												Неопределено, Неопределено,
	//												Неопределено, 1,
	//												ВалютаДокумента, Номер,
	//												мУказаниеСкладовВТЧ,
	//												ТипЦен, , ДоговорКонтрагента, УсловиеПродаж);

	//Если      ИмяТекСтраницы = "Товары" Тогда
	//	ОбработкаПодбора(Товары, СтруктураПодбора);
	//ИначеЕсли ИмяТекСтраницы = "Тара" Тогда
	//	ОбработкаПодбора(ВозвратнаяТара, СтруктураПодбора);
	//ИначеЕсли ИмяТекСтраницы = "Услуги" Тогда
	//	ОбработкаПодбора(Услуги, СтруктураПодбора);
	//Иначе
	//	Предупреждение("На странице """
	//				   + ИмяТекСтраницы
	//				   + """ подбор номенклатуры не предусмотрен.");
	//КонецЕсли;

	Возврат Результат;

КонецФункции // СШКСерийныйНомер()

&НаКлиенте
// Функция осуществляет обработку считывания штрихкода информационной карты
//
// Параметры:
//  Карта    - <СправочникСсылка.ИнформационныеКарты>
//           - Отсканированная информационная карта.
//
//  СШК      - <Строка>
//           - Идентификатор сканера штрихкода, с которым связано данное
//             событие.
//
// Возвращаемое значение:
//  <Булево> - Данная ситуация обработана.
//
Функция СШКИнформационнаяКарта(Карта, СШК) Экспорт

	Результат = Истина;

	//Если РаботаСТорговымОборудованием.ПроверитьСообщитьЧтоКартаНеДисконтная(Карта) Тогда
	//	Возврат Результат;
	//КонецЕсли;

	//ДисконтнаяКарта = Карта;
	//ПриИзмененииДисконтнойКарты();

	Возврат Результат;

КонецФункции // СШКИнформационнаяКарта()

&НаКлиенте
// Функция осуществляет обработку считывания штрихового кода, который не был
// зарегистрирован.
//
// Параметры:
//  Штрихкод - <Строка>
//           - Считанный код.
//
//  ТипКода  - <ПланыВидовХарактеристикСсылка.ТипыШтрихкодов>
//           - Тип штрихкода. Пустая ссылка в случае, если тип определить не
//             представляется возможным.
//
//  СШК      - <Строка>
//           - Идентификатор сканера штрихкода, с которым связано данное
//             событие.
//
// Возвращаемое значение:
//  <Булево> - Данная ситуация обработана.
//
Функция СШКНеизвестныйКод(Штрихкод, ТипКода, СШК) Экспорт

	Возврат Ложь;

КонецФункции // СШКНеизвестныйКод()

&НаКлиенте
Функция СШКРейс(ВыбР) Экспорт
	Если ЗначениеЗаполнено(ВыбР) Тогда
		Зап = Новый Запрос;
		Зап.Текст = "ВЫБРАТЬ
		            |	ПечатьЧековПоДоставкам.Ссылка Как Док
		            |ИЗ
		            |	Документ.ПечатьЧековПоДоставкам КАК ПечатьЧековПоДоставкам
		            |ГДЕ
		            |	ПечатьЧековПоДоставкам.Рейс = &Рейс";
		Зап.УстановитьПараметр("Рейс", ВыбР);			
		Рез = Зап.Выполнить().Выгрузить();
		Если Не Рез.Количество() = 0 Тогда
			Док = Рез[0].Док;
			Ф = Док.ПолучитьФорму("ФормаДокумента");
			Ф.Открыть();
			Сообщить("Документ уже создан!");
		Иначе	
			Ф = ОткрытьФорму("Документ.ПечатьЧековПоДоставкам.ФормаОбъекта");			
			Ф.Объект.ТипЗаказа = Перечисления.ТипыЗаказов.Доставка;
			Ф.Объект.Дата = ТекущаяДата();
			Ф.Объект.Рейс = ВыбР;
			Ф.ЗаполнитьДоставкиИТовары(Неопределено);
		КонецеСли;	
	Иначе
		Возврат Ложь;
	КонецеСли;	
	Возврат Истина;
КонецФункции	

//&НаКлиенте
//Функция СШКЗаказы(Стр) Экспорт
//	Если ЗначениеЗаполнено(Стр) Тогда
//		Зап = Новый Запрос;
//		Зап.Текст = "ВЫБРАТЬ
//		|	ПечатьЧековПоДоставкамДоставки.Ссылка.Ссылка Как Док
//		|ИЗ
//		|	Документ.ПечатьЧековПоДоставкам.Доставки КАК ПечатьЧековПоДоставкамДоставки
//		|ГДЕ
//		|	ПечатьЧековПоДоставкамДоставки.Доставка.Ссылка = &ВыбДост";
//		Зап.УстановитьПараметр("ВыбДост", Стр.Реализация.Ссылка);
//		
//		рез = Зап.Выполнить().Выгрузить();
//		
//		Если Не Рез.Количество() = 0 Тогда
//			Док = Рез[0].Док;
//			Ф = Док.ПолучитьФорму("ФормаДокумента");
//			Ф.Открыть();
//			Сообщить("Документ уже создан!");
//		Иначе	
//			Ф = ОткрытьФорму("Документ.ПечатьЧековПоДоставкам.ФормаОбъекта");
//			Ф.Объект.ТипЗаказа = Перечисления.ТипыЗаказов.Самовывоз;
//			Ф.Объект.Дата = ТекущаяДата();
//			Ф.ДобавитьСтрокуСамовывоза(Стр.Реализация);
//			
//			
//		КонецеСли;	
//	Иначе
//		Возврат Ложь;
//	КонецеСли;	
//	Возврат истина;
//КонецФункции	

&НаКлиенте
// Процедура осуществляет обработку ошибки, произошедшей при работе со сканером
// штрихкода.
//
// Параметры:
//  Ошибка    - <ПеречислениеСсылка.ТООшибки*>
//            - Возникшая ошибка.
//
//  Штрихкод  - <Строка>
//            - Считанный штрихкод или пустая строка, если штрихкод не был
//              считан.
//
//  ТипШК     - <ПланыВидовХарактеристикСсылка.ТипыШтрихкодов>
//            - Тип штрихкода или пустая ссылка в случае, если тип не определён.
//
//  СШК       - <Строка>
//            - Идентификатор сканера штрихкода, с которым связано данное
//              событие.
//
Процедура СШКОшибка(Ошибка, Штрихкод, ТипШК, СШК) Экспорт

	Текст = ПолучитьСерверТО().ПолучитьТекстОшибкиСШКТО(Ошибка, Штрихкод, ТипШК);
	Предупреждение(Текст);

КонецПроцедуры // СШКОшибка()

&НаКлиенте
Процедура ПриЗакрытии()
	ПолучитьСерверТО().ОтключитьКлиента(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПолучитьСерверТО().ПодключитьКлиента(ЭтаФорма);
КонецПроцедуры


Функция ПроверкаНаЧастичку(ДокДанныеМП)
	
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ДанныеЗаказаВодителяДоставленныеТовары.Номенклатура,
	                      |	СУММА(ДанныеЗаказаВодителяДоставленныеТовары.КоличествоДоставлено) КАК КоличествоДоставлено
	                      |ПОМЕСТИТЬ ВТ_Данные
	                      |ИЗ
	                      |	Документ.ДанныеЗаказаВодителя.ДоставленныеТовары КАК ДанныеЗаказаВодителяДоставленныеТовары
	                      |ГДЕ
	                      |	ДанныеЗаказаВодителяДоставленныеТовары.Ссылка.Ссылка = &СсылкаМП
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ДанныеЗаказаВодителяДоставленныеТовары.Номенклатура
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	РеализацияТоваровУслугТовары.Номенклатура,
	                      |	СУММА(РеализацияТоваровУслугТовары.Количество) КАК Количество
	                      |ПОМЕСТИТЬ ВТ_Реализация
	                      |ИЗ
	                      |	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	                      |ГДЕ
	                      |	РеализацияТоваровУслугТовары.Ссылка.Ссылка = &СсылкаРеализация
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	РеализацияТоваровУслугТовары.Номенклатура
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	РеализацияТоваровУслугПодарочныеПозиции.Номенклатура,
	                      |	СУММА(РеализацияТоваровУслугПодарочныеПозиции.Количество)
	                      |ИЗ
	                      |	Документ.РеализацияТоваровУслуг.ПодарочныеПозиции КАК РеализацияТоваровУслугПодарочныеПозиции
	                      |ГДЕ
	                      |	РеализацияТоваровУслугПодарочныеПозиции.Ссылка.Ссылка = &СсылкаРеализация
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	РеализацияТоваровУслугПодарочныеПозиции.Номенклатура
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТ_Данные.Номенклатура,
	                      |	ВТ_Реализация.Количество - ВТ_Данные.КоличествоДоставлено КАК КоличествоНеДоставлено
	                      |ИЗ
	                      |	ВТ_Данные КАК ВТ_Данные
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Реализация КАК ВТ_Реализация
	                      |		ПО ВТ_Данные.Номенклатура = ВТ_Реализация.Номенклатура");
	Запрос.УстановитьПараметр("СсылкаМП", ДокДанныеМП);
	Запрос.УстановитьПараметр("СсылкаРеализация", ДокДанныеМП.Реализация);
	Рез = Запрос.Выполнить().Выбрать();
	
	Пока Рез.Следующий() Цикл
		
		Если Рез.КоличествоНеДоставлено = NULL Тогда
			Продолжить;	
		КонецЕсли;
		
		Если Рез.КоличествоНеДоставлено > 0 Тогда		
			Возврат	Истина;		
		КонецЕсли;
		
	КонецЦикла;	
	
	Возврат Ложь;
	

КонецФункции // ()

&НаКлиенте
Процедура ПечатьАПП(Команда)
	
	ПечатныйДокумент = Новый ТабличныйДокумент;
	ПечатныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ПечатныйДокумент.Автомасштаб = Истина;
	
	ТекДанные = Элементы.Список.ТекущиеДанные;
	Объект = ТекДанные.Ссылка;
	ПечатьНаСервере(ПечатныйДокумент, Объект);
	
	
	ПечатныйДокумент.ФиксацияСверху = 3;
	ПечатныйДокумент.ПолеСлева = 3;

	ПечатныйДокумент.ОтображатьЗаголовки = Ложь;
	ПечатныйДокумент.ОтображатьСетку     = Ложь;
	ПечатныйДокумент.ТолькоПросмотр      = Истина;
	
	ПечатныйДокумент.Показать();
	
КонецПроцедуры

Процедура ПечатьНаСервере(ПечатныйДокумент, Объект)

	//ДокОбъект = ДанныеФормыВЗначение("Список", ); 
	
	ДокОбъект = Объект.ПолучитьОбъект(); 
	ДокОбъект.ПечатьАПП(ПечатныйДокумент);


КонецПроцедуры                                          

//+++ БАО 22.08.2017 №1730
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	bao.ДобавитьОтборДинСпискаПоДоступнымПользователюТерминалам(Список);
	
	//Асеев 16.09.2020 (Задача № 4247)>>>
	УстановитьНадписьТумблерОтбора();
	//Асеев 16.09.2020 (Задача № 4247)<<<
	
КонецПроцедуры

//&НаСервере
//Процедура СоздатьДокументПередачаЗаказовНаВозвратНаСервере()
//	
//	До
//	
//КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументПередачаЗаказовНаВозврат(Команда)
	
	ОткрытьФорму("Документ.ПередачаЗаказовНаВозврат.Форма.ФормаДокумента", Новый Структура("Ключ", ПредопределенноеЗначение("Документ.ПередачаЗаказовНаВозврат.ПустаяСсылка")));
	
	//СоздатьДокументПередачаЗаказовНаВозвратНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДокументыНаВозврат(Команда)
	
	ОткрытьФорму("Документ.ПередачаЗаказовНаВозврат.Форма.ФормаСписка");
	
КонецПроцедуры

//Асеев 16.09.2020 (Задача № 4247)>>>
&НаСервере
Процедура УстановитьНадписьТумблерОтбора()
	
	СписокВыбора = Элементы.ТумблерОтбора.СписокВыбора;
	ЭлементСписка = СписокВыбора.НайтиПоЗначению(ТумблерОтбора);
	Если ЭлементСписка <> Неопределено Тогда
		Элементы.НадписьТумблерОтбора.Заголовок = ЭлементСписка.Представление;
	Иначе
		Элементы.НадписьТумблерОтбора.Заголовок = "Неизвестный отбор";
	КонецЕсли;
	Если ТумблерОтбора = 2 Или ТумблерОтбора = 3 Тогда
		//УдаленноеЗакрытие Или Подтверждение
		Элементы.НадписьТумблерОтбора.ЦветТекста = WebЦвета.Синий;
	Иначе
		Элементы.НадписьТумблерОтбора.ЦветТекста = WebЦвета.Черный;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ТумблерОтбораПриИзмененииНаСервере()
	
	ИмяОтбора = "ТумблерОтбора";
	
	ОбщегоНазначенияКлиентСервер83.УдалитьЭлементыГруппыОтбора(Список.Отбор,, ИмяОтбора);
	
	Если ТумблерОтбора = 1 Тогда
		//ФактСдача
		ГруппаЭлементовОтбора = ОбщегоНазначенияКлиентСервер83.СоздатьГруппуЭлементовОтбора(Список.Отбор.Элементы, ИмяОтбора, ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
		ОбщегоНазначенияКлиентСервер83.УстановитьЭлементОтбора(ГруппаЭлементовОтбора, "УдаленноеЗакрытие", Ложь, ВидСравненияКомпоновкиДанных.Равно,, Истина);
		ОбщегоНазначенияКлиентСервер83.УстановитьЭлементОтбора(ГруппаЭлементовОтбора, "ДокументУдаленногоЗакрытия",, ВидСравненияКомпоновкиДанных.НеЗаполнено,, Истина);
	ИначеЕсли ТумблерОтбора = 2 Тогда
		//УдаленноеЗакрытие
		ГруппаЭлементовОтбора = ОбщегоНазначенияКлиентСервер83.СоздатьГруппуЭлементовОтбора(Список.Отбор.Элементы, ИмяОтбора, ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
		ОбщегоНазначенияКлиентСервер83.УстановитьЭлементОтбора(ГруппаЭлементовОтбора, "УдаленноеЗакрытие", Истина, ВидСравненияКомпоновкиДанных.Равно,, Истина);
	ИначеЕсли ТумблерОтбора = 3 Тогда
		//Подтверждение
		ГруппаЭлементовОтбора = ОбщегоНазначенияКлиентСервер83.СоздатьГруппуЭлементовОтбора(Список.Отбор.Элементы, ИмяОтбора, ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
		ОбщегоНазначенияКлиентСервер83.УстановитьЭлементОтбора(ГруппаЭлементовОтбора, "РежимПодтвержденияУдаленногоЗакрытия", Истина, ВидСравненияКомпоновкиДанных.Равно,, Истина);
	КонецЕсли;
	
	УстановитьНадписьТумблерОтбора();
	
КонецПроцедуры

&НаКлиенте
Процедура ТумблерОтбораПриИзменении(Элемент)
	ТумблерОтбораПриИзмененииНаСервере();
КонецПроцедуры
//Асеев 16.09.2020 (Задача № 4247)<<<

//--- БАО 22.08.2017 №1730
